
# Auto-generated by Interface Designer
#
# WARNING: Any manual changes made to this file will be lost when generating constraints.

# Efinity Interface Designer SDC
# Version: 2025.1.110.5.9
# Date: 2025-11-29 10:43

# Copyright (C) 2013 - 2025 Efinix Inc. All rights reserved.

# Device: Ti90G529
# Project: tools_core
# Timing Model: C4 (final)

# PLL Constraints
#################
create_clock -period 1.333 -name lvds_clk_fast_clkin3_feedback [get_ports {lvds_clk_fast_clkin3_feedback}]
create_clock -waveform {0.333 1.000} -period 1.333 -name lvds_clk_fast_clkin3 [get_ports {lvds_clk_fast_clkin3}]
create_clock -period 6.667 -name lvds_clk_slow_clkin3 [get_ports {lvds_clk_slow_clkin3}]
create_clock -period 1.333 -name lvds_clk_fast_clkin4_feedback [get_ports {lvds_clk_fast_clkin4_feedback}]
create_clock -waveform {0.333 1.000} -period 1.333 -name lvds_clk_fast_clkin4 [get_ports {lvds_clk_fast_clkin4}]
create_clock -period 6.667 -name lvds_clk_slow_clkin4 [get_ports {lvds_clk_slow_clkin4}]
create_clock -period 1.333 -name lvds_clk_fast_clkin2_feedback [get_ports {lvds_clk_fast_clkin2_feedback}]
create_clock -waveform {0.333 1.000} -period 1.333 -name lvds_clk_fast_clkin2 [get_ports {lvds_clk_fast_clkin2}]
create_clock -period 6.667 -name lvds_clk_slow_clkin2 [get_ports {lvds_clk_slow_clkin2}]
create_clock -period 1.333 -name lvds_clk_fast_clkin1_feedback [get_ports {lvds_clk_fast_clkin1_feedback}]
create_clock -waveform {0.333 1.000} -period 1.333 -name lvds_clk_fast_clkin1 [get_ports {lvds_clk_fast_clkin1}]
create_clock -period 6.667 -name lvds_clk_slow_clkin1 [get_ports {lvds_clk_slow_clkin1}]
create_clock -period 10.000 -name regACLK [get_ports {regACLK}]
create_clock -period 5.000 -name axi0_ACLK [get_ports {axi0_ACLK}]
create_clock -period 5.000 -name clk_command [get_ports {clk_command}]
create_clock -period 20.000 -name clk50 [get_ports {clk50}]

# GPIO Constraints
####################
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {boardin[7]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {boardin[7]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_clk}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_clk}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_rxf_n}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_rxf_n}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_txe_n}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_txe_n}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {spi_miso}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {spi_miso}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {fan_out}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {fan_out}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_gpio0}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_gpio0}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_gpio1}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_gpio1}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_oe_n}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_oe_n}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_rd_n}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_rd_n}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_resetn}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_resetn}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_siwu}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_siwu}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_wakeupn}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_wakeupn}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_wr_n}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_wr_n}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {led2}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {led2}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {LED[0]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {LED[0]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {LED[1]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {LED[1]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {LED[2]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {LED[2]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {LED[3]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {LED[3]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {neo_led}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {neo_led}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {spi_clk}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {spi_clk}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {spi_mosi}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {spi_mosi}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {spics[0]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {spics[0]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {spics[1]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {spics[1]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {spics[2]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {spics[2]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {spics[3]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {spics[3]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {spics[4]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {spics[4]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {spics[5]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {spics[5]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {spics[6]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {spics[6]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {spics[7]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {spics[7]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_be_IN[3]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_be_IN[3]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_be_OUT[3]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_be_OUT[3]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_be_OE[3]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_be_OE[3]}]

# DDR Constraints
#####################
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 3.675 [get_ports {axi0_ARESETn}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.000 [get_ports {axi0_ARESETn}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_ARADDR[*]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_ARADDR[*]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_ARAPCMD}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_ARAPCMD}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_ARBURST[1] axi0_ARBURST[0]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_ARBURST[1] axi0_ARBURST[0]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_ARID[*]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_ARID[*]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_ARLEN[*]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_ARLEN[*]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_ARSIZE[2] axi0_ARSIZE[1] axi0_ARSIZE[0]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_ARSIZE[2] axi0_ARSIZE[1] axi0_ARSIZE[0]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_ARVALID}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_ARVALID}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_ARLOCK}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_ARLOCK}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_ARQOS}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_ARQOS}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_AWADDR[*]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_AWADDR[*]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_AWAPCMD}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.350 [get_ports {axi0_AWAPCMD}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_AWALLSTRB}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_AWALLSTRB}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_AWBURST[1] axi0_AWBURST[0]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_AWBURST[1] axi0_AWBURST[0]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_AWCOBUF}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_AWCOBUF}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_AWID[*]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_AWID[*]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_AWLEN[*]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_AWLEN[*]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_AWSIZE[2] axi0_AWSIZE[1] axi0_AWSIZE[0]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_AWSIZE[2] axi0_AWSIZE[1] axi0_AWSIZE[0]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_AWVALID}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_AWVALID}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_AWLOCK}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_AWLOCK}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_AWCACHE[3] axi0_AWCACHE[2] axi0_AWCACHE[1] axi0_AWCACHE[0]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_AWCACHE[3] axi0_AWCACHE[2] axi0_AWCACHE[1] axi0_AWCACHE[0]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_AWQOS}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_AWQOS}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_BREADY}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_BREADY}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_RREADY}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_RREADY}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_WDATA[*]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_WDATA[*]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_WLAST}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_WLAST}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_WSTRB[*]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_WSTRB[*]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_WVALID}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_WVALID}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.625 [get_ports {axi0_ARREADY}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min 1.750 [get_ports {axi0_ARREADY}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.520 [get_ports {axi0_AWREADY}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min 1.680 [get_ports {axi0_AWREADY}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.520 [get_ports {axi0_BID[*]}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min 1.680 [get_ports {axi0_BID[*]}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.625 [get_ports {axi0_BRESP[1] axi0_BRESP[0]}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min 1.750 [get_ports {axi0_BRESP[1] axi0_BRESP[0]}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.625 [get_ports {axi0_BVALID}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min 1.750 [get_ports {axi0_BVALID}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.625 [get_ports {axi0_RDATA[*]}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min 1.750 [get_ports {axi0_RDATA[*]}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.625 [get_ports {axi0_RID[*]}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min 1.750 [get_ports {axi0_RID[*]}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.625 [get_ports {axi0_RLAST}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min 1.750 [get_ports {axi0_RLAST}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.625 [get_ports {axi0_RRESP[1] axi0_RRESP[0]}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min 1.750 [get_ports {axi0_RRESP[1] axi0_RRESP[0]}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.625 [get_ports {axi0_RVALID}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min 1.750 [get_ports {axi0_RVALID}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.625 [get_ports {axi0_WREADY}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min 1.750 [get_ports {axi0_WREADY}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 3.675 [get_ports {regARESETn}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min -0.000 [get_ports {regARESETn}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.625 [get_ports {regARADDR[*]}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min -0.140 [get_ports {regARADDR[*]}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.625 [get_ports {regARID[*]}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min -0.140 [get_ports {regARID[*]}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.625 [get_ports {regARLEN[*]}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min -0.140 [get_ports {regARLEN[*]}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.625 [get_ports {regARSIZE[2] regARSIZE[1] regARSIZE[0]}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min -0.140 [get_ports {regARSIZE[2] regARSIZE[1] regARSIZE[0]}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.625 [get_ports {regARBURST[1] regARBURST[0]}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min -0.140 [get_ports {regARBURST[1] regARBURST[0]}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.625 [get_ports {regARVALID}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min -0.140 [get_ports {regARVALID}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.625 [get_ports {regAWADDR[*]}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min -0.140 [get_ports {regAWADDR[*]}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.625 [get_ports {regAWID[*]}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min -0.140 [get_ports {regAWID[*]}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.625 [get_ports {regAWLEN[*]}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min -0.140 [get_ports {regAWLEN[*]}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.625 [get_ports {regAWSIZE[2] regAWSIZE[1] regAWSIZE[0]}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min -0.140 [get_ports {regAWSIZE[2] regAWSIZE[1] regAWSIZE[0]}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.625 [get_ports {regAWBURST[1] regAWBURST[0]}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min -0.140 [get_ports {regAWBURST[1] regAWBURST[0]}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.625 [get_ports {regAWVALID}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min -0.140 [get_ports {regAWVALID}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.625 [get_ports {regBREADY}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min -0.140 [get_ports {regBREADY}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.625 [get_ports {regRREADY}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min -0.140 [get_ports {regRREADY}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.625 [get_ports {regWDATA[*]}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min -0.140 [get_ports {regWDATA[*]}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.625 [get_ports {regWSTRB[3] regWSTRB[2] regWSTRB[1] regWSTRB[0]}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min -0.140 [get_ports {regWSTRB[3] regWSTRB[2] regWSTRB[1] regWSTRB[0]}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.625 [get_ports {regWLAST}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min -0.140 [get_ports {regWLAST}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.625 [get_ports {regWVALID}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min -0.140 [get_ports {regWVALID}]
set_input_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.100 [get_ports {regARREADY}]
set_input_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min 1.400 [get_ports {regARREADY}]
set_input_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.100 [get_ports {regAWREADY}]
set_input_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min 1.400 [get_ports {regAWREADY}]
set_input_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.100 [get_ports {regBID[*]}]
set_input_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min 1.400 [get_ports {regBID[*]}]
set_input_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.100 [get_ports {regBRESP[1] regBRESP[0]}]
set_input_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min 1.400 [get_ports {regBRESP[1] regBRESP[0]}]
set_input_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.100 [get_ports {regBVALID}]
set_input_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min 1.400 [get_ports {regBVALID}]
set_input_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.100 [get_ports {regRDATA[*]}]
set_input_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min 1.400 [get_ports {regRDATA[*]}]
set_input_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.100 [get_ports {regRID[*]}]
set_input_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min 1.400 [get_ports {regRID[*]}]
set_input_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.100 [get_ports {regRRESP[1] regRRESP[0]}]
set_input_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min 1.400 [get_ports {regRRESP[1] regRRESP[0]}]
set_input_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.100 [get_ports {regRLAST}]
set_input_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min 1.400 [get_ports {regRLAST}]
set_input_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.100 [get_ports {regRVALID}]
set_input_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min 1.400 [get_ports {regRVALID}]
set_input_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.100 [get_ports {regWREADY}]
set_input_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min 1.400 [get_ports {regWREADY}]

# HSIO GPIO Constraints
#########################
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {boardin[0]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {boardin[0]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {boardin[1]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {boardin[1]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {boardin[2]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {boardin[2]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {boardin[3]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {boardin[3]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {boardin[4]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {boardin[4]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {boardin[5]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {boardin[5]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {boardin[6]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {boardin[6]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {exttrigin}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {exttrigin}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {lockinfo[0]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {lockinfo[0]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {lockinfo[1]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {lockinfo[1]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {lockinfo[2]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {lockinfo[2]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {lockinfo[3]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {lockinfo[3]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {overrange[0]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {overrange[0]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {overrange[1]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {overrange[1]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {overrange[2]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {overrange[2]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {overrange[3]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {overrange[3]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {auxout}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {auxout}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {boardout[0]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {boardout[0]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {boardout[1]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {boardout[1]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {boardout[2]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {boardout[2]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {boardout[3]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {boardout[3]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {boardout[4]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {boardout[4]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {boardout[5]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {boardout[5]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {boardout[6]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {boardout[6]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {boardout[7]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {boardout[7]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {debugout[0]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {debugout[0]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {debugout[1]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {debugout[1]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {debugout[2]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {debugout[2]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {debugout[3]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {debugout[3]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {debugout[4]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {debugout[4]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {debugout[5]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {debugout[5]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {debugout[6]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {debugout[6]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {debugout[7]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {debugout[7]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {debugout[8]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {debugout[8]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {debugout[9]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {debugout[9]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {debugout[10]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {debugout[10]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {debugout[11]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {debugout[11]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_be_IN[0]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_be_IN[0]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_be_OUT[0]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_be_OUT[0]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_be_OE[0]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_be_OE[0]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_be_IN[1]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_be_IN[1]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_be_OUT[1]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_be_OUT[1]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_be_OE[1]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_be_OE[1]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_be_IN[2]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_be_IN[2]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_be_OUT[2]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_be_OUT[2]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_be_OE[2]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_be_OE[2]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_IN[0]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_IN[0]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OUT[0]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OUT[0]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OE[0]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OE[0]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_IN[1]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_IN[1]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OUT[1]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OUT[1]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OE[1]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OE[1]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_IN[2]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_IN[2]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OUT[2]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OUT[2]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OE[2]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OE[2]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_IN[3]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_IN[3]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OUT[3]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OUT[3]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OE[3]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OE[3]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_IN[4]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_IN[4]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OUT[4]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OUT[4]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OE[4]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OE[4]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_IN[5]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_IN[5]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OUT[5]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OUT[5]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OE[5]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OE[5]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_IN[6]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_IN[6]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OUT[6]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OUT[6]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OE[6]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OE[6]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_IN[7]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_IN[7]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OUT[7]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OUT[7]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OE[7]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OE[7]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_IN[8]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_IN[8]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OUT[8]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OUT[8]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OE[8]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OE[8]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_IN[9]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_IN[9]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OUT[9]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OUT[9]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OE[9]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OE[9]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_IN[10]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_IN[10]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OUT[10]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OUT[10]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OE[10]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OE[10]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_IN[11]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_IN[11]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OUT[11]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OUT[11]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OE[11]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OE[11]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_IN[12]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_IN[12]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OUT[12]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OUT[12]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OE[12]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OE[12]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_IN[13]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_IN[13]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OUT[13]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OUT[13]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OE[13]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OE[13]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_IN[14]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_IN[14]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OUT[14]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OUT[14]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OE[14]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OE[14]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_IN[15]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_IN[15]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OUT[15]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OUT[15]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OE[15]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OE[15]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_IN[16]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_IN[16]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OUT[16]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OUT[16]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OE[16]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OE[16]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_IN[17]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_IN[17]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OUT[17]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OUT[17]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OE[17]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OE[17]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_IN[18]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_IN[18]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OUT[18]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OUT[18]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OE[18]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OE[18]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_IN[19]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_IN[19]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OUT[19]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OUT[19]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OE[19]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OE[19]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_IN[20]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_IN[20]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OUT[20]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OUT[20]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OE[20]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OE[20]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_IN[21]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_IN[21]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OUT[21]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OUT[21]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OE[21]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OE[21]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_IN[22]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_IN[22]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OUT[22]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OUT[22]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OE[22]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OE[22]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_IN[23]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_IN[23]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OUT[23]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OUT[23]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OE[23]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OE[23]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_IN[24]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_IN[24]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OUT[24]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OUT[24]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OE[24]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OE[24]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_IN[25]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_IN[25]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OUT[25]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OUT[25]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OE[25]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OE[25]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_IN[26]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_IN[26]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OUT[26]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OUT[26]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OE[26]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OE[26]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_IN[27]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_IN[27]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OUT[27]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OUT[27]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OE[27]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OE[27]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_IN[28]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_IN[28]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OUT[28]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OUT[28]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OE[28]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OE[28]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_IN[29]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_IN[29]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OUT[29]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OUT[29]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OE[29]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OE[29]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_IN[30]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_IN[30]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OUT[30]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OUT[30]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OE[30]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OE[30]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_IN[31]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_IN[31]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OUT[31]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OUT[31]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ftdi_data_OE[31]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ftdi_data_OE[31]}]

# LVDS Rx Constraints
#######################
set_input_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~264~642}] -max 0.512 [get_ports {lvds_rx1_1_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~264~642}] -min 0.342 [get_ports {lvds_rx1_1_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~89~642}] -max 0.512 [get_ports {lvds_rx1_10_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~89~642}] -min 0.342 [get_ports {lvds_rx1_10_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~97~642}] -max 0.512 [get_ports {lvds_rx1_11_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~97~642}] -min 0.342 [get_ports {lvds_rx1_11_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~115~642}] -max 0.512 [get_ports {lvds_rx1_12_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~115~642}] -min 0.342 [get_ports {lvds_rx1_12_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~124~642}] -max 0.512 [get_ports {lvds_rx1_13_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~124~642}] -min 0.342 [get_ports {lvds_rx1_13_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~19~642}] -max 0.512 [get_ports {lvds_rx1_2_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~19~642}] -min 0.342 [get_ports {lvds_rx1_2_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~27~642}] -max 0.512 [get_ports {lvds_rx1_3_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~27~642}] -min 0.342 [get_ports {lvds_rx1_3_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~38~642}] -max 0.512 [get_ports {lvds_rx1_4_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~38~642}] -min 0.342 [get_ports {lvds_rx1_4_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~46~642}] -max 0.512 [get_ports {lvds_rx1_5_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~46~642}] -min 0.342 [get_ports {lvds_rx1_5_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~54~642}] -max 0.512 [get_ports {lvds_rx1_6_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~54~642}] -min 0.342 [get_ports {lvds_rx1_6_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~64~642}] -max 0.512 [get_ports {lvds_rx1_7_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~64~642}] -min 0.342 [get_ports {lvds_rx1_7_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~72~642}] -max 0.512 [get_ports {lvds_rx1_8_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~72~642}] -min 0.342 [get_ports {lvds_rx1_8_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~80~642}] -max 0.512 [get_ports {lvds_rx1_9_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~80~642}] -min 0.342 [get_ports {lvds_rx1_9_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~133~642}] -max 0.512 [get_ports {lvds_rx2_1_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~133~642}] -min 0.342 [get_ports {lvds_rx2_1_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~273~642}] -max 0.512 [get_ports {lvds_rx2_10_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~273~642}] -min 0.342 [get_ports {lvds_rx2_10_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~238~642}] -max 0.512 [get_ports {lvds_rx2_11_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~238~642}] -min 0.342 [get_ports {lvds_rx2_11_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~247~642}] -max 0.512 [get_ports {lvds_rx2_12_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~247~642}] -min 0.342 [get_ports {lvds_rx2_12_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~255~642}] -max 0.512 [get_ports {lvds_rx2_13_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~255~642}] -min 0.342 [get_ports {lvds_rx2_13_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~141~642}] -max 0.512 [get_ports {lvds_rx2_2_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~141~642}] -min 0.342 [get_ports {lvds_rx2_2_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~150~642}] -max 0.512 [get_ports {lvds_rx2_3_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~150~642}] -min 0.342 [get_ports {lvds_rx2_3_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~179~642}] -max 0.512 [get_ports {lvds_rx2_4_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~179~642}] -min 0.342 [get_ports {lvds_rx2_4_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~187~642}] -max 0.512 [get_ports {lvds_rx2_5_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~187~642}] -min 0.342 [get_ports {lvds_rx2_5_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~195~642}] -max 0.512 [get_ports {lvds_rx2_6_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~195~642}] -min 0.342 [get_ports {lvds_rx2_6_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~203~642}] -max 0.512 [get_ports {lvds_rx2_7_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~203~642}] -min 0.342 [get_ports {lvds_rx2_7_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~211~642}] -max 0.512 [get_ports {lvds_rx2_8_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~211~642}] -min 0.342 [get_ports {lvds_rx2_8_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~220~642}] -max 0.512 [get_ports {lvds_rx2_9_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~220~642}] -min 0.342 [get_ports {lvds_rx2_9_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~264~1}] -max 0.512 [get_ports {lvds_rx3_1_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~264~1}] -min 0.342 [get_ports {lvds_rx3_1_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~89~1}] -max 0.512 [get_ports {lvds_rx3_10_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~89~1}] -min 0.342 [get_ports {lvds_rx3_10_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~97~1}] -max 0.512 [get_ports {lvds_rx3_11_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~97~1}] -min 0.342 [get_ports {lvds_rx3_11_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~115~1}] -max 0.512 [get_ports {lvds_rx3_12_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~115~1}] -min 0.342 [get_ports {lvds_rx3_12_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~124~1}] -max 0.512 [get_ports {lvds_rx3_13_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~124~1}] -min 0.342 [get_ports {lvds_rx3_13_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~19~1}] -max 0.512 [get_ports {lvds_rx3_2_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~19~1}] -min 0.342 [get_ports {lvds_rx3_2_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~27~1}] -max 0.512 [get_ports {lvds_rx3_3_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~27~1}] -min 0.342 [get_ports {lvds_rx3_3_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~38~1}] -max 0.512 [get_ports {lvds_rx3_4_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~38~1}] -min 0.342 [get_ports {lvds_rx3_4_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~46~1}] -max 0.512 [get_ports {lvds_rx3_5_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~46~1}] -min 0.342 [get_ports {lvds_rx3_5_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~54~1}] -max 0.512 [get_ports {lvds_rx3_6_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~54~1}] -min 0.342 [get_ports {lvds_rx3_6_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~64~1}] -max 0.512 [get_ports {lvds_rx3_7_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~64~1}] -min 0.342 [get_ports {lvds_rx3_7_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~72~1}] -max 0.512 [get_ports {lvds_rx3_8_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~72~1}] -min 0.342 [get_ports {lvds_rx3_8_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~80~1}] -max 0.512 [get_ports {lvds_rx3_9_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~80~1}] -min 0.342 [get_ports {lvds_rx3_9_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~133~1}] -max 0.512 [get_ports {lvds_rx4_1_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~133~1}] -min 0.342 [get_ports {lvds_rx4_1_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~230~1}] -max 0.512 [get_ports {lvds_rx4_10_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~230~1}] -min 0.342 [get_ports {lvds_rx4_10_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~238~1}] -max 0.512 [get_ports {lvds_rx4_11_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~238~1}] -min 0.342 [get_ports {lvds_rx4_11_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~247~1}] -max 0.512 [get_ports {lvds_rx4_12_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~247~1}] -min 0.342 [get_ports {lvds_rx4_12_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~255~1}] -max 0.512 [get_ports {lvds_rx4_13_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~255~1}] -min 0.342 [get_ports {lvds_rx4_13_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~141~1}] -max 0.512 [get_ports {lvds_rx4_2_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~141~1}] -min 0.342 [get_ports {lvds_rx4_2_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~150~1}] -max 0.512 [get_ports {lvds_rx4_3_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~150~1}] -min 0.342 [get_ports {lvds_rx4_3_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~179~1}] -max 0.512 [get_ports {lvds_rx4_4_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~179~1}] -min 0.342 [get_ports {lvds_rx4_4_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~187~1}] -max 0.512 [get_ports {lvds_rx4_5_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~187~1}] -min 0.342 [get_ports {lvds_rx4_5_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~195~1}] -max 0.512 [get_ports {lvds_rx4_6_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~195~1}] -min 0.342 [get_ports {lvds_rx4_6_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~203~1}] -max 0.512 [get_ports {lvds_rx4_7_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~203~1}] -min 0.342 [get_ports {lvds_rx4_7_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~211~1}] -max 0.512 [get_ports {lvds_rx4_8_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~211~1}] -min 0.342 [get_ports {lvds_rx4_8_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~220~1}] -max 0.512 [get_ports {lvds_rx4_9_RX_DATA[*]}]
set_input_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~220~1}] -min 0.342 [get_ports {lvds_rx4_9_RX_DATA[*]}]
set_output_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~264~642}] -max 0.315 [get_ports {lvds_rx1_1_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~264~642}] -min -0.140 [get_ports {lvds_rx1_1_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~89~642}] -max 0.315 [get_ports {lvds_rx1_10_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~89~642}] -min -0.140 [get_ports {lvds_rx1_10_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~97~642}] -max 0.315 [get_ports {lvds_rx1_11_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~97~642}] -min -0.140 [get_ports {lvds_rx1_11_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~115~642}] -max 0.315 [get_ports {lvds_rx1_12_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~115~642}] -min -0.140 [get_ports {lvds_rx1_12_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~124~642}] -max 0.315 [get_ports {lvds_rx1_13_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~124~642}] -min -0.140 [get_ports {lvds_rx1_13_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~19~642}] -max 0.315 [get_ports {lvds_rx1_2_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~19~642}] -min -0.140 [get_ports {lvds_rx1_2_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~27~642}] -max 0.315 [get_ports {lvds_rx1_3_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~27~642}] -min -0.140 [get_ports {lvds_rx1_3_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~38~642}] -max 0.315 [get_ports {lvds_rx1_4_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~38~642}] -min -0.140 [get_ports {lvds_rx1_4_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~46~642}] -max 0.315 [get_ports {lvds_rx1_5_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~46~642}] -min -0.140 [get_ports {lvds_rx1_5_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~54~642}] -max 0.315 [get_ports {lvds_rx1_6_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~54~642}] -min -0.140 [get_ports {lvds_rx1_6_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~64~642}] -max 0.315 [get_ports {lvds_rx1_7_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~64~642}] -min -0.140 [get_ports {lvds_rx1_7_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~72~642}] -max 0.315 [get_ports {lvds_rx1_8_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~72~642}] -min -0.140 [get_ports {lvds_rx1_8_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~80~642}] -max 0.315 [get_ports {lvds_rx1_9_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~80~642}] -min -0.140 [get_ports {lvds_rx1_9_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~133~642}] -max 0.315 [get_ports {lvds_rx2_1_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~133~642}] -min -0.140 [get_ports {lvds_rx2_1_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~273~642}] -max 0.315 [get_ports {lvds_rx2_10_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~273~642}] -min -0.140 [get_ports {lvds_rx2_10_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~238~642}] -max 0.315 [get_ports {lvds_rx2_11_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~238~642}] -min -0.140 [get_ports {lvds_rx2_11_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~247~642}] -max 0.315 [get_ports {lvds_rx2_12_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~247~642}] -min -0.140 [get_ports {lvds_rx2_12_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~255~642}] -max 0.315 [get_ports {lvds_rx2_13_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~255~642}] -min -0.140 [get_ports {lvds_rx2_13_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~141~642}] -max 0.315 [get_ports {lvds_rx2_2_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~141~642}] -min -0.140 [get_ports {lvds_rx2_2_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~150~642}] -max 0.315 [get_ports {lvds_rx2_3_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~150~642}] -min -0.140 [get_ports {lvds_rx2_3_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~179~642}] -max 0.315 [get_ports {lvds_rx2_4_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~179~642}] -min -0.140 [get_ports {lvds_rx2_4_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~187~642}] -max 0.315 [get_ports {lvds_rx2_5_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~187~642}] -min -0.140 [get_ports {lvds_rx2_5_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~195~642}] -max 0.315 [get_ports {lvds_rx2_6_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~195~642}] -min -0.140 [get_ports {lvds_rx2_6_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~203~642}] -max 0.315 [get_ports {lvds_rx2_7_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~203~642}] -min -0.140 [get_ports {lvds_rx2_7_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~211~642}] -max 0.315 [get_ports {lvds_rx2_8_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~211~642}] -min -0.140 [get_ports {lvds_rx2_8_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~220~642}] -max 0.315 [get_ports {lvds_rx2_9_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~220~642}] -min -0.140 [get_ports {lvds_rx2_9_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~264~1}] -max 0.315 [get_ports {lvds_rx3_1_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~264~1}] -min -0.140 [get_ports {lvds_rx3_1_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~89~1}] -max 0.315 [get_ports {lvds_rx3_10_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~89~1}] -min -0.140 [get_ports {lvds_rx3_10_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~97~1}] -max 0.315 [get_ports {lvds_rx3_11_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~97~1}] -min -0.140 [get_ports {lvds_rx3_11_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~115~1}] -max 0.315 [get_ports {lvds_rx3_12_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~115~1}] -min -0.140 [get_ports {lvds_rx3_12_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~124~1}] -max 0.315 [get_ports {lvds_rx3_13_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~124~1}] -min -0.140 [get_ports {lvds_rx3_13_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~19~1}] -max 0.315 [get_ports {lvds_rx3_2_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~19~1}] -min -0.140 [get_ports {lvds_rx3_2_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~27~1}] -max 0.315 [get_ports {lvds_rx3_3_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~27~1}] -min -0.140 [get_ports {lvds_rx3_3_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~38~1}] -max 0.315 [get_ports {lvds_rx3_4_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~38~1}] -min -0.140 [get_ports {lvds_rx3_4_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~46~1}] -max 0.315 [get_ports {lvds_rx3_5_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~46~1}] -min -0.140 [get_ports {lvds_rx3_5_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~54~1}] -max 0.315 [get_ports {lvds_rx3_6_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~54~1}] -min -0.140 [get_ports {lvds_rx3_6_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~64~1}] -max 0.315 [get_ports {lvds_rx3_7_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~64~1}] -min -0.140 [get_ports {lvds_rx3_7_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~72~1}] -max 0.315 [get_ports {lvds_rx3_8_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~72~1}] -min -0.140 [get_ports {lvds_rx3_8_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~80~1}] -max 0.315 [get_ports {lvds_rx3_9_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~80~1}] -min -0.140 [get_ports {lvds_rx3_9_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~133~1}] -max 0.315 [get_ports {lvds_rx4_1_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~133~1}] -min -0.140 [get_ports {lvds_rx4_1_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~230~1}] -max 0.315 [get_ports {lvds_rx4_10_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~230~1}] -min -0.140 [get_ports {lvds_rx4_10_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~238~1}] -max 0.315 [get_ports {lvds_rx4_11_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~238~1}] -min -0.140 [get_ports {lvds_rx4_11_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~247~1}] -max 0.315 [get_ports {lvds_rx4_12_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~247~1}] -min -0.140 [get_ports {lvds_rx4_12_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~255~1}] -max 0.315 [get_ports {lvds_rx4_13_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~255~1}] -min -0.140 [get_ports {lvds_rx4_13_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~141~1}] -max 0.315 [get_ports {lvds_rx4_2_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~141~1}] -min -0.140 [get_ports {lvds_rx4_2_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~150~1}] -max 0.315 [get_ports {lvds_rx4_3_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~150~1}] -min -0.140 [get_ports {lvds_rx4_3_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~179~1}] -max 0.315 [get_ports {lvds_rx4_4_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~179~1}] -min -0.140 [get_ports {lvds_rx4_4_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~187~1}] -max 0.315 [get_ports {lvds_rx4_5_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~187~1}] -min -0.140 [get_ports {lvds_rx4_5_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~195~1}] -max 0.315 [get_ports {lvds_rx4_6_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~195~1}] -min -0.140 [get_ports {lvds_rx4_6_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~203~1}] -max 0.315 [get_ports {lvds_rx4_7_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~203~1}] -min -0.140 [get_ports {lvds_rx4_7_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~211~1}] -max 0.315 [get_ports {lvds_rx4_8_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~211~1}] -min -0.140 [get_ports {lvds_rx4_8_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~220~1}] -max 0.315 [get_ports {lvds_rx4_9_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~220~1}] -min -0.140 [get_ports {lvds_rx4_9_RX_RST}]
set_output_delay -clock lvds_clk_slow_clkin1 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~264~642}] -max 0.252 [get_ports {lvds_rx1_1_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin1 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~264~642}] -min -0.140 [get_ports {lvds_rx1_1_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin1 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~264~642}] -max 0.252 [get_ports {lvds_rx1_1_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin1 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~264~642}] -min -0.140 [get_ports {lvds_rx1_1_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~264~642}] -max 0.315 [get_ports {lvds_rx1_1_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~264~642}] -min -0.140 [get_ports {lvds_rx1_1_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin1 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~89~642}] -max 0.252 [get_ports {lvds_rx1_10_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin1 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~89~642}] -min -0.140 [get_ports {lvds_rx1_10_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin1 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~89~642}] -max 0.252 [get_ports {lvds_rx1_10_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin1 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~89~642}] -min -0.140 [get_ports {lvds_rx1_10_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~89~642}] -max 0.315 [get_ports {lvds_rx1_10_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~89~642}] -min -0.140 [get_ports {lvds_rx1_10_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin1 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~97~642}] -max 0.252 [get_ports {lvds_rx1_11_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin1 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~97~642}] -min -0.140 [get_ports {lvds_rx1_11_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin1 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~97~642}] -max 0.252 [get_ports {lvds_rx1_11_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin1 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~97~642}] -min -0.140 [get_ports {lvds_rx1_11_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~97~642}] -max 0.315 [get_ports {lvds_rx1_11_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~97~642}] -min -0.140 [get_ports {lvds_rx1_11_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin1 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~115~642}] -max 0.252 [get_ports {lvds_rx1_12_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin1 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~115~642}] -min -0.140 [get_ports {lvds_rx1_12_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin1 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~115~642}] -max 0.252 [get_ports {lvds_rx1_12_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin1 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~115~642}] -min -0.140 [get_ports {lvds_rx1_12_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~115~642}] -max 0.315 [get_ports {lvds_rx1_12_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~115~642}] -min -0.140 [get_ports {lvds_rx1_12_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin1 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~124~642}] -max 0.252 [get_ports {lvds_rx1_13_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin1 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~124~642}] -min -0.140 [get_ports {lvds_rx1_13_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin1 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~124~642}] -max 0.252 [get_ports {lvds_rx1_13_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin1 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~124~642}] -min -0.140 [get_ports {lvds_rx1_13_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~124~642}] -max 0.315 [get_ports {lvds_rx1_13_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~124~642}] -min -0.140 [get_ports {lvds_rx1_13_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin1 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~19~642}] -max 0.252 [get_ports {lvds_rx1_2_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin1 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~19~642}] -min -0.140 [get_ports {lvds_rx1_2_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin1 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~19~642}] -max 0.252 [get_ports {lvds_rx1_2_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin1 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~19~642}] -min -0.140 [get_ports {lvds_rx1_2_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~19~642}] -max 0.315 [get_ports {lvds_rx1_2_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~19~642}] -min -0.140 [get_ports {lvds_rx1_2_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin1 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~27~642}] -max 0.252 [get_ports {lvds_rx1_3_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin1 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~27~642}] -min -0.140 [get_ports {lvds_rx1_3_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin1 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~27~642}] -max 0.252 [get_ports {lvds_rx1_3_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin1 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~27~642}] -min -0.140 [get_ports {lvds_rx1_3_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~27~642}] -max 0.315 [get_ports {lvds_rx1_3_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~27~642}] -min -0.140 [get_ports {lvds_rx1_3_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin1 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~38~642}] -max 0.252 [get_ports {lvds_rx1_4_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin1 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~38~642}] -min -0.140 [get_ports {lvds_rx1_4_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin1 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~38~642}] -max 0.252 [get_ports {lvds_rx1_4_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin1 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~38~642}] -min -0.140 [get_ports {lvds_rx1_4_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~38~642}] -max 0.315 [get_ports {lvds_rx1_4_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~38~642}] -min -0.140 [get_ports {lvds_rx1_4_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin1 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~46~642}] -max 0.252 [get_ports {lvds_rx1_5_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin1 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~46~642}] -min -0.140 [get_ports {lvds_rx1_5_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin1 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~46~642}] -max 0.252 [get_ports {lvds_rx1_5_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin1 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~46~642}] -min -0.140 [get_ports {lvds_rx1_5_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~46~642}] -max 0.315 [get_ports {lvds_rx1_5_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~46~642}] -min -0.140 [get_ports {lvds_rx1_5_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin1 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~54~642}] -max 0.252 [get_ports {lvds_rx1_6_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin1 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~54~642}] -min -0.140 [get_ports {lvds_rx1_6_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin1 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~54~642}] -max 0.252 [get_ports {lvds_rx1_6_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin1 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~54~642}] -min -0.140 [get_ports {lvds_rx1_6_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~54~642}] -max 0.315 [get_ports {lvds_rx1_6_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~54~642}] -min -0.140 [get_ports {lvds_rx1_6_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin1 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~64~642}] -max 0.252 [get_ports {lvds_rx1_7_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin1 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~64~642}] -min -0.140 [get_ports {lvds_rx1_7_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin1 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~64~642}] -max 0.252 [get_ports {lvds_rx1_7_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin1 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~64~642}] -min -0.140 [get_ports {lvds_rx1_7_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~64~642}] -max 0.315 [get_ports {lvds_rx1_7_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~64~642}] -min -0.140 [get_ports {lvds_rx1_7_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin1 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~72~642}] -max 0.252 [get_ports {lvds_rx1_8_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin1 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~72~642}] -min -0.140 [get_ports {lvds_rx1_8_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin1 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~72~642}] -max 0.252 [get_ports {lvds_rx1_8_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin1 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~72~642}] -min -0.140 [get_ports {lvds_rx1_8_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~72~642}] -max 0.315 [get_ports {lvds_rx1_8_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~72~642}] -min -0.140 [get_ports {lvds_rx1_8_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin1 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~80~642}] -max 0.252 [get_ports {lvds_rx1_9_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin1 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~80~642}] -min -0.140 [get_ports {lvds_rx1_9_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin1 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~80~642}] -max 0.252 [get_ports {lvds_rx1_9_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin1 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~80~642}] -min -0.140 [get_ports {lvds_rx1_9_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~80~642}] -max 0.315 [get_ports {lvds_rx1_9_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin1 -reference_pin [get_ports {lvds_clk_slow_clkin1~CLKOUT~80~642}] -min -0.140 [get_ports {lvds_rx1_9_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin2 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~133~642}] -max 0.252 [get_ports {lvds_rx2_1_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin2 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~133~642}] -min -0.140 [get_ports {lvds_rx2_1_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin2 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~133~642}] -max 0.252 [get_ports {lvds_rx2_1_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin2 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~133~642}] -min -0.140 [get_ports {lvds_rx2_1_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~133~642}] -max 0.315 [get_ports {lvds_rx2_1_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~133~642}] -min -0.140 [get_ports {lvds_rx2_1_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin2 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~273~642}] -max 0.252 [get_ports {lvds_rx2_10_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin2 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~273~642}] -min -0.140 [get_ports {lvds_rx2_10_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin2 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~273~642}] -max 0.252 [get_ports {lvds_rx2_10_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin2 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~273~642}] -min -0.140 [get_ports {lvds_rx2_10_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~273~642}] -max 0.315 [get_ports {lvds_rx2_10_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~273~642}] -min -0.140 [get_ports {lvds_rx2_10_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin2 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~238~642}] -max 0.252 [get_ports {lvds_rx2_11_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin2 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~238~642}] -min -0.140 [get_ports {lvds_rx2_11_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin2 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~238~642}] -max 0.252 [get_ports {lvds_rx2_11_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin2 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~238~642}] -min -0.140 [get_ports {lvds_rx2_11_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~238~642}] -max 0.315 [get_ports {lvds_rx2_11_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~238~642}] -min -0.140 [get_ports {lvds_rx2_11_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin2 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~247~642}] -max 0.252 [get_ports {lvds_rx2_12_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin2 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~247~642}] -min -0.140 [get_ports {lvds_rx2_12_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin2 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~247~642}] -max 0.252 [get_ports {lvds_rx2_12_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin2 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~247~642}] -min -0.140 [get_ports {lvds_rx2_12_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~247~642}] -max 0.315 [get_ports {lvds_rx2_12_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~247~642}] -min -0.140 [get_ports {lvds_rx2_12_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin2 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~255~642}] -max 0.252 [get_ports {lvds_rx2_13_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin2 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~255~642}] -min -0.140 [get_ports {lvds_rx2_13_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin2 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~255~642}] -max 0.252 [get_ports {lvds_rx2_13_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin2 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~255~642}] -min -0.140 [get_ports {lvds_rx2_13_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~255~642}] -max 0.315 [get_ports {lvds_rx2_13_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~255~642}] -min -0.140 [get_ports {lvds_rx2_13_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin2 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~141~642}] -max 0.252 [get_ports {lvds_rx2_2_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin2 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~141~642}] -min -0.140 [get_ports {lvds_rx2_2_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin2 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~141~642}] -max 0.252 [get_ports {lvds_rx2_2_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin2 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~141~642}] -min -0.140 [get_ports {lvds_rx2_2_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~141~642}] -max 0.315 [get_ports {lvds_rx2_2_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~141~642}] -min -0.140 [get_ports {lvds_rx2_2_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin2 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~150~642}] -max 0.252 [get_ports {lvds_rx2_3_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin2 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~150~642}] -min -0.140 [get_ports {lvds_rx2_3_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin2 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~150~642}] -max 0.252 [get_ports {lvds_rx2_3_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin2 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~150~642}] -min -0.140 [get_ports {lvds_rx2_3_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~150~642}] -max 0.315 [get_ports {lvds_rx2_3_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~150~642}] -min -0.140 [get_ports {lvds_rx2_3_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin2 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~179~642}] -max 0.252 [get_ports {lvds_rx2_4_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin2 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~179~642}] -min -0.140 [get_ports {lvds_rx2_4_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin2 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~179~642}] -max 0.252 [get_ports {lvds_rx2_4_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin2 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~179~642}] -min -0.140 [get_ports {lvds_rx2_4_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~179~642}] -max 0.315 [get_ports {lvds_rx2_4_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~179~642}] -min -0.140 [get_ports {lvds_rx2_4_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin2 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~187~642}] -max 0.252 [get_ports {lvds_rx2_5_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin2 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~187~642}] -min -0.140 [get_ports {lvds_rx2_5_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin2 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~187~642}] -max 0.252 [get_ports {lvds_rx2_5_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin2 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~187~642}] -min -0.140 [get_ports {lvds_rx2_5_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~187~642}] -max 0.315 [get_ports {lvds_rx2_5_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~187~642}] -min -0.140 [get_ports {lvds_rx2_5_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin2 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~195~642}] -max 0.252 [get_ports {lvds_rx2_6_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin2 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~195~642}] -min -0.140 [get_ports {lvds_rx2_6_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin2 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~195~642}] -max 0.252 [get_ports {lvds_rx2_6_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin2 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~195~642}] -min -0.140 [get_ports {lvds_rx2_6_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~195~642}] -max 0.315 [get_ports {lvds_rx2_6_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~195~642}] -min -0.140 [get_ports {lvds_rx2_6_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin2 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~203~642}] -max 0.252 [get_ports {lvds_rx2_7_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin2 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~203~642}] -min -0.140 [get_ports {lvds_rx2_7_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin2 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~203~642}] -max 0.252 [get_ports {lvds_rx2_7_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin2 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~203~642}] -min -0.140 [get_ports {lvds_rx2_7_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~203~642}] -max 0.315 [get_ports {lvds_rx2_7_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~203~642}] -min -0.140 [get_ports {lvds_rx2_7_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin2 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~211~642}] -max 0.252 [get_ports {lvds_rx2_8_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin2 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~211~642}] -min -0.140 [get_ports {lvds_rx2_8_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin2 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~211~642}] -max 0.252 [get_ports {lvds_rx2_8_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin2 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~211~642}] -min -0.140 [get_ports {lvds_rx2_8_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~211~642}] -max 0.315 [get_ports {lvds_rx2_8_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~211~642}] -min -0.140 [get_ports {lvds_rx2_8_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin2 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~220~642}] -max 0.252 [get_ports {lvds_rx2_9_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin2 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~220~642}] -min -0.140 [get_ports {lvds_rx2_9_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin2 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~220~642}] -max 0.252 [get_ports {lvds_rx2_9_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin2 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~220~642}] -min -0.140 [get_ports {lvds_rx2_9_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~220~642}] -max 0.315 [get_ports {lvds_rx2_9_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin2 -reference_pin [get_ports {lvds_clk_slow_clkin2~CLKOUT~220~642}] -min -0.140 [get_ports {lvds_rx2_9_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin3 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~264~1}] -max 0.252 [get_ports {lvds_rx3_1_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin3 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~264~1}] -min -0.140 [get_ports {lvds_rx3_1_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin3 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~264~1}] -max 0.252 [get_ports {lvds_rx3_1_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin3 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~264~1}] -min -0.140 [get_ports {lvds_rx3_1_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~264~1}] -max 0.315 [get_ports {lvds_rx3_1_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~264~1}] -min -0.140 [get_ports {lvds_rx3_1_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin3 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~89~1}] -max 0.252 [get_ports {lvds_rx3_10_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin3 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~89~1}] -min -0.140 [get_ports {lvds_rx3_10_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin3 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~89~1}] -max 0.252 [get_ports {lvds_rx3_10_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin3 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~89~1}] -min -0.140 [get_ports {lvds_rx3_10_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~89~1}] -max 0.315 [get_ports {lvds_rx3_10_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~89~1}] -min -0.140 [get_ports {lvds_rx3_10_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin3 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~97~1}] -max 0.252 [get_ports {lvds_rx3_11_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin3 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~97~1}] -min -0.140 [get_ports {lvds_rx3_11_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin3 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~97~1}] -max 0.252 [get_ports {lvds_rx3_11_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin3 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~97~1}] -min -0.140 [get_ports {lvds_rx3_11_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~97~1}] -max 0.315 [get_ports {lvds_rx3_11_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~97~1}] -min -0.140 [get_ports {lvds_rx3_11_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin3 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~115~1}] -max 0.252 [get_ports {lvds_rx3_12_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin3 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~115~1}] -min -0.140 [get_ports {lvds_rx3_12_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin3 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~115~1}] -max 0.252 [get_ports {lvds_rx3_12_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin3 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~115~1}] -min -0.140 [get_ports {lvds_rx3_12_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~115~1}] -max 0.315 [get_ports {lvds_rx3_12_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~115~1}] -min -0.140 [get_ports {lvds_rx3_12_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin3 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~124~1}] -max 0.252 [get_ports {lvds_rx3_13_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin3 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~124~1}] -min -0.140 [get_ports {lvds_rx3_13_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin3 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~124~1}] -max 0.252 [get_ports {lvds_rx3_13_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin3 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~124~1}] -min -0.140 [get_ports {lvds_rx3_13_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~124~1}] -max 0.315 [get_ports {lvds_rx3_13_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~124~1}] -min -0.140 [get_ports {lvds_rx3_13_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin3 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~19~1}] -max 0.252 [get_ports {lvds_rx3_2_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin3 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~19~1}] -min -0.140 [get_ports {lvds_rx3_2_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin3 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~19~1}] -max 0.252 [get_ports {lvds_rx3_2_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin3 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~19~1}] -min -0.140 [get_ports {lvds_rx3_2_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~19~1}] -max 0.315 [get_ports {lvds_rx3_2_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~19~1}] -min -0.140 [get_ports {lvds_rx3_2_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin3 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~27~1}] -max 0.252 [get_ports {lvds_rx3_3_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin3 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~27~1}] -min -0.140 [get_ports {lvds_rx3_3_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin3 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~27~1}] -max 0.252 [get_ports {lvds_rx3_3_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin3 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~27~1}] -min -0.140 [get_ports {lvds_rx3_3_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~27~1}] -max 0.315 [get_ports {lvds_rx3_3_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~27~1}] -min -0.140 [get_ports {lvds_rx3_3_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin3 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~38~1}] -max 0.252 [get_ports {lvds_rx3_4_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin3 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~38~1}] -min -0.140 [get_ports {lvds_rx3_4_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin3 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~38~1}] -max 0.252 [get_ports {lvds_rx3_4_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin3 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~38~1}] -min -0.140 [get_ports {lvds_rx3_4_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~38~1}] -max 0.315 [get_ports {lvds_rx3_4_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~38~1}] -min -0.140 [get_ports {lvds_rx3_4_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin3 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~46~1}] -max 0.252 [get_ports {lvds_rx3_5_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin3 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~46~1}] -min -0.140 [get_ports {lvds_rx3_5_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin3 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~46~1}] -max 0.252 [get_ports {lvds_rx3_5_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin3 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~46~1}] -min -0.140 [get_ports {lvds_rx3_5_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~46~1}] -max 0.315 [get_ports {lvds_rx3_5_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~46~1}] -min -0.140 [get_ports {lvds_rx3_5_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin3 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~54~1}] -max 0.252 [get_ports {lvds_rx3_6_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin3 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~54~1}] -min -0.140 [get_ports {lvds_rx3_6_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin3 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~54~1}] -max 0.252 [get_ports {lvds_rx3_6_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin3 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~54~1}] -min -0.140 [get_ports {lvds_rx3_6_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~54~1}] -max 0.315 [get_ports {lvds_rx3_6_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~54~1}] -min -0.140 [get_ports {lvds_rx3_6_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin3 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~64~1}] -max 0.252 [get_ports {lvds_rx3_7_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin3 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~64~1}] -min -0.140 [get_ports {lvds_rx3_7_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin3 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~64~1}] -max 0.252 [get_ports {lvds_rx3_7_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin3 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~64~1}] -min -0.140 [get_ports {lvds_rx3_7_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~64~1}] -max 0.315 [get_ports {lvds_rx3_7_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~64~1}] -min -0.140 [get_ports {lvds_rx3_7_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin3 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~72~1}] -max 0.252 [get_ports {lvds_rx3_8_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin3 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~72~1}] -min -0.140 [get_ports {lvds_rx3_8_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin3 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~72~1}] -max 0.252 [get_ports {lvds_rx3_8_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin3 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~72~1}] -min -0.140 [get_ports {lvds_rx3_8_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~72~1}] -max 0.315 [get_ports {lvds_rx3_8_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~72~1}] -min -0.140 [get_ports {lvds_rx3_8_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin3 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~80~1}] -max 0.252 [get_ports {lvds_rx3_9_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin3 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~80~1}] -min -0.140 [get_ports {lvds_rx3_9_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin3 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~80~1}] -max 0.252 [get_ports {lvds_rx3_9_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin3 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~80~1}] -min -0.140 [get_ports {lvds_rx3_9_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~80~1}] -max 0.315 [get_ports {lvds_rx3_9_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin3 -reference_pin [get_ports {lvds_clk_slow_clkin3~CLKOUT~80~1}] -min -0.140 [get_ports {lvds_rx3_9_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin4 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~133~1}] -max 0.252 [get_ports {lvds_rx4_1_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin4 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~133~1}] -min -0.140 [get_ports {lvds_rx4_1_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin4 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~133~1}] -max 0.252 [get_ports {lvds_rx4_1_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin4 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~133~1}] -min -0.140 [get_ports {lvds_rx4_1_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~133~1}] -max 0.315 [get_ports {lvds_rx4_1_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~133~1}] -min -0.140 [get_ports {lvds_rx4_1_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin4 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~230~1}] -max 0.252 [get_ports {lvds_rx4_10_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin4 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~230~1}] -min -0.140 [get_ports {lvds_rx4_10_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin4 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~230~1}] -max 0.252 [get_ports {lvds_rx4_10_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin4 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~230~1}] -min -0.140 [get_ports {lvds_rx4_10_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~230~1}] -max 0.315 [get_ports {lvds_rx4_10_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~230~1}] -min -0.140 [get_ports {lvds_rx4_10_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin4 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~238~1}] -max 0.252 [get_ports {lvds_rx4_11_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin4 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~238~1}] -min -0.140 [get_ports {lvds_rx4_11_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin4 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~238~1}] -max 0.252 [get_ports {lvds_rx4_11_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin4 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~238~1}] -min -0.140 [get_ports {lvds_rx4_11_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~238~1}] -max 0.315 [get_ports {lvds_rx4_11_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~238~1}] -min -0.140 [get_ports {lvds_rx4_11_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin4 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~247~1}] -max 0.252 [get_ports {lvds_rx4_12_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin4 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~247~1}] -min -0.140 [get_ports {lvds_rx4_12_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin4 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~247~1}] -max 0.252 [get_ports {lvds_rx4_12_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin4 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~247~1}] -min -0.140 [get_ports {lvds_rx4_12_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~247~1}] -max 0.315 [get_ports {lvds_rx4_12_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~247~1}] -min -0.140 [get_ports {lvds_rx4_12_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin4 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~255~1}] -max 0.252 [get_ports {lvds_rx4_13_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin4 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~255~1}] -min -0.140 [get_ports {lvds_rx4_13_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin4 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~255~1}] -max 0.252 [get_ports {lvds_rx4_13_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin4 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~255~1}] -min -0.140 [get_ports {lvds_rx4_13_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~255~1}] -max 0.315 [get_ports {lvds_rx4_13_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~255~1}] -min -0.140 [get_ports {lvds_rx4_13_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin4 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~141~1}] -max 0.252 [get_ports {lvds_rx4_2_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin4 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~141~1}] -min -0.140 [get_ports {lvds_rx4_2_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin4 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~141~1}] -max 0.252 [get_ports {lvds_rx4_2_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin4 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~141~1}] -min -0.140 [get_ports {lvds_rx4_2_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~141~1}] -max 0.315 [get_ports {lvds_rx4_2_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~141~1}] -min -0.140 [get_ports {lvds_rx4_2_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin4 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~150~1}] -max 0.252 [get_ports {lvds_rx4_3_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin4 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~150~1}] -min -0.140 [get_ports {lvds_rx4_3_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin4 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~150~1}] -max 0.252 [get_ports {lvds_rx4_3_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin4 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~150~1}] -min -0.140 [get_ports {lvds_rx4_3_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~150~1}] -max 0.315 [get_ports {lvds_rx4_3_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~150~1}] -min -0.140 [get_ports {lvds_rx4_3_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin4 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~179~1}] -max 0.252 [get_ports {lvds_rx4_4_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin4 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~179~1}] -min -0.140 [get_ports {lvds_rx4_4_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin4 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~179~1}] -max 0.252 [get_ports {lvds_rx4_4_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin4 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~179~1}] -min -0.140 [get_ports {lvds_rx4_4_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~179~1}] -max 0.315 [get_ports {lvds_rx4_4_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~179~1}] -min -0.140 [get_ports {lvds_rx4_4_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin4 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~187~1}] -max 0.252 [get_ports {lvds_rx4_5_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin4 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~187~1}] -min -0.140 [get_ports {lvds_rx4_5_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin4 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~187~1}] -max 0.252 [get_ports {lvds_rx4_5_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin4 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~187~1}] -min -0.140 [get_ports {lvds_rx4_5_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~187~1}] -max 0.315 [get_ports {lvds_rx4_5_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~187~1}] -min -0.140 [get_ports {lvds_rx4_5_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin4 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~195~1}] -max 0.252 [get_ports {lvds_rx4_6_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin4 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~195~1}] -min -0.140 [get_ports {lvds_rx4_6_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin4 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~195~1}] -max 0.252 [get_ports {lvds_rx4_6_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin4 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~195~1}] -min -0.140 [get_ports {lvds_rx4_6_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~195~1}] -max 0.315 [get_ports {lvds_rx4_6_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~195~1}] -min -0.140 [get_ports {lvds_rx4_6_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin4 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~203~1}] -max 0.252 [get_ports {lvds_rx4_7_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin4 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~203~1}] -min -0.140 [get_ports {lvds_rx4_7_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin4 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~203~1}] -max 0.252 [get_ports {lvds_rx4_7_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin4 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~203~1}] -min -0.140 [get_ports {lvds_rx4_7_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~203~1}] -max 0.315 [get_ports {lvds_rx4_7_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~203~1}] -min -0.140 [get_ports {lvds_rx4_7_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin4 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~211~1}] -max 0.252 [get_ports {lvds_rx4_8_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin4 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~211~1}] -min -0.140 [get_ports {lvds_rx4_8_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin4 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~211~1}] -max 0.252 [get_ports {lvds_rx4_8_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin4 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~211~1}] -min -0.140 [get_ports {lvds_rx4_8_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~211~1}] -max 0.315 [get_ports {lvds_rx4_8_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~211~1}] -min -0.140 [get_ports {lvds_rx4_8_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin4 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~220~1}] -max 0.252 [get_ports {lvds_rx4_9_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin4 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~220~1}] -min -0.140 [get_ports {lvds_rx4_9_RX_DLY_ENA}]
set_output_delay -clock lvds_clk_slow_clkin4 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~220~1}] -max 0.252 [get_ports {lvds_rx4_9_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin4 -clock_fall -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~220~1}] -min -0.140 [get_ports {lvds_rx4_9_RX_DLY_INC}]
set_output_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~220~1}] -max 0.315 [get_ports {lvds_rx4_9_RX_DLY_RST}]
set_output_delay -clock lvds_clk_slow_clkin4 -reference_pin [get_ports {lvds_clk_slow_clkin4~CLKOUT~220~1}] -min -0.140 [get_ports {lvds_rx4_9_RX_DLY_RST}]

# LVDS Tx Constraints
#######################

# Clock Latency Constraints
############################
# set_clock_latency -source -setup <board_max + 0.924> [get_ports {lvds_clk_fast_clkin3_feedback}]
# set_clock_latency -source -hold <board_min + 0.616> [get_ports {lvds_clk_fast_clkin3_feedback}]
# set_clock_latency -source -setup <board_max + 0.924> [get_ports {lvds_clk_fast_clkin3}]
# set_clock_latency -source -hold <board_min + 0.616> [get_ports {lvds_clk_fast_clkin3}]
# set_clock_latency -source -setup <board_max + 0.924> [get_ports {lvds_clk_slow_clkin3}]
# set_clock_latency -source -hold <board_min + 0.616> [get_ports {lvds_clk_slow_clkin3}]
# set_clock_latency -source -setup <board_max + 0.924> [get_ports {lvds_clk_fast_clkin4_feedback}]
# set_clock_latency -source -hold <board_min + 0.616> [get_ports {lvds_clk_fast_clkin4_feedback}]
# set_clock_latency -source -setup <board_max + 0.924> [get_ports {lvds_clk_fast_clkin4}]
# set_clock_latency -source -hold <board_min + 0.616> [get_ports {lvds_clk_fast_clkin4}]
# set_clock_latency -source -setup <board_max + 0.924> [get_ports {lvds_clk_slow_clkin4}]
# set_clock_latency -source -hold <board_min + 0.616> [get_ports {lvds_clk_slow_clkin4}]
# set_clock_latency -source -setup <board_max + 0.924> [get_ports {lvds_clk_fast_clkin2_feedback}]
# set_clock_latency -source -hold <board_min + 0.616> [get_ports {lvds_clk_fast_clkin2_feedback}]
# set_clock_latency -source -setup <board_max + 0.924> [get_ports {lvds_clk_fast_clkin2}]
# set_clock_latency -source -hold <board_min + 0.616> [get_ports {lvds_clk_fast_clkin2}]
# set_clock_latency -source -setup <board_max + 0.924> [get_ports {lvds_clk_slow_clkin2}]
# set_clock_latency -source -hold <board_min + 0.616> [get_ports {lvds_clk_slow_clkin2}]
# set_clock_latency -source -setup <board_max + 0.924> [get_ports {lvds_clk_fast_clkin1_feedback}]
# set_clock_latency -source -hold <board_min + 0.616> [get_ports {lvds_clk_fast_clkin1_feedback}]
# set_clock_latency -source -setup <board_max + 0.924> [get_ports {lvds_clk_fast_clkin1}]
# set_clock_latency -source -hold <board_min + 0.616> [get_ports {lvds_clk_fast_clkin1}]
# set_clock_latency -source -setup <board_max + 0.924> [get_ports {lvds_clk_slow_clkin1}]
# set_clock_latency -source -hold <board_min + 0.616> [get_ports {lvds_clk_slow_clkin1}]
# set_clock_latency -source -setup <board_max + 1.907> [get_ports {regACLK}]
# set_clock_latency -source -hold <board_min + 1.271> [get_ports {regACLK}]
# set_clock_latency -source -setup <board_max + 1.907> [get_ports {axi0_ACLK}]
# set_clock_latency -source -hold <board_min + 1.271> [get_ports {axi0_ACLK}]
# set_clock_latency -source -setup <board_max + 1.907> [get_ports {clk_command}]
# set_clock_latency -source -hold <board_min + 1.271> [get_ports {clk_command}]
# set_clock_latency -source -setup <board_max + 1.907> [get_ports {clk50}]
# set_clock_latency -source -hold <board_min + 1.271> [get_ports {clk50}]
