
# Efinity Interface Designer SDC
# Version: 2023.M.80
# Date: 2023-05-11 11:20

# Copyright (C) 2017 - 2023 Efinix Inc. All rights reserved.

# Device: Ti180M484B
# Project: char_lpddr4_simple
# Timing Model: C4 (preliminary)
#               NOTE: The timing data is not final

# PLL Constraints
#################
create_clock -period 15.0000 regACLK
create_clock -period 15.0000 axi0_ACLK
create_clock -period 166.67 [get_ports {jtag_inst1_TCK}]

set_clock_groups -asynchronous  -group {axi0_ACLK} -group {regACLK} -group {jtag_inst1_TCK}

# GPIO Constraints
####################
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ddr_pllin}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ddr_pllin}]

# JTAG Constraints
####################
set_output_delay -clock jtag_inst1_TCK -max 0.117 [get_ports {jtag_inst1_TDO}]
set_output_delay -clock jtag_inst1_TCK -min -0.075 [get_ports {jtag_inst1_TDO}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.280 [get_ports {jtag_inst1_CAPTURE}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.187 [get_ports {jtag_inst1_CAPTURE}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.280 [get_ports {jtag_inst1_RESET}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.187 [get_ports {jtag_inst1_RESET}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.243 [get_ports {jtag_inst1_SEL}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.162 [get_ports {jtag_inst1_SEL}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.280 [get_ports {jtag_inst1_UPDATE}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.187 [get_ports {jtag_inst1_UPDATE}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.337 [get_ports {jtag_inst1_SHIFT}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.225 [get_ports {jtag_inst1_SHIFT}]
# JTAG Constraints (extra... not used by current Efinity debug tools)
# create_clock -period <USER_PERIOD> [get_ports {jtag_inst1_DRCK}]
# set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.280 [get_ports {jtag_inst1_RUNTEST}]
# set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.187 [get_ports {jtag_inst1_RUNTEST}]

# DDR Constraints
#####################
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 3.675 [get_ports {axi0_ARESETn}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.000 [get_ports {axi0_ARESETn}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_ARADDR[*]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_ARADDR[*]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_ARAPCMD}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_ARAPCMD}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_ARBURST[1] axi0_ARBURST[0]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_ARBURST[1] axi0_ARBURST[0]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_ARID[*]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_ARID[*]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_ARLEN[*]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_ARLEN[*]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_ARSIZE[2] axi0_ARSIZE[1] axi0_ARSIZE[0]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_ARSIZE[2] axi0_ARSIZE[1] axi0_ARSIZE[0]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_ARVALID}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_ARVALID}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_ARLOCK}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_ARLOCK}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_ARQOS}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_ARQOS}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_AWADDR[*]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_AWADDR[*]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_AWAPCMD}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.350 [get_ports {axi0_AWAPCMD}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_AWALLSTRB}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_AWALLSTRB}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_AWBURST[1] axi0_AWBURST[0]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_AWBURST[1] axi0_AWBURST[0]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_AWCOBUF}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_AWCOBUF}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_AWID[*]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_AWID[*]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_AWLEN[*]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_AWLEN[*]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_AWSIZE[2] axi0_AWSIZE[1] axi0_AWSIZE[0]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_AWSIZE[2] axi0_AWSIZE[1] axi0_AWSIZE[0]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_AWVALID}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_AWVALID}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_AWLOCK}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_AWLOCK}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_AWCACHE[3] axi0_AWCACHE[2] axi0_AWCACHE[1] axi0_AWCACHE[0]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_AWCACHE[3] axi0_AWCACHE[2] axi0_AWCACHE[1] axi0_AWCACHE[0]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_AWQOS}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_AWQOS}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_BREADY}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_BREADY}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_RREADY}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_RREADY}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_WDATA[*]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_WDATA[*]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_WLAST}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_WLAST}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_WSTRB[*]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_WSTRB[*]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_WVALID}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_WVALID}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.625 [get_ports {axi0_ARREADY}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min 1.750 [get_ports {axi0_ARREADY}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.520 [get_ports {axi0_AWREADY}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min 1.680 [get_ports {axi0_AWREADY}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.520 [get_ports {axi0_BID[*]}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min 1.680 [get_ports {axi0_BID[*]}]
#set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.625 [get_ports {axi0_BRESP[1] axi0_BRESP[0]}]
#set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min 1.750 [get_ports {axi0_BRESP[1] axi0_BRESP[0]}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.625 [get_ports {axi0_BVALID}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min 1.750 [get_ports {axi0_BVALID}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.625 [get_ports {axi0_RDATA[*]}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min 1.750 [get_ports {axi0_RDATA[*]}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.625 [get_ports {axi0_RID[*]}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min 1.750 [get_ports {axi0_RID[*]}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.625 [get_ports {axi0_RLAST}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min 1.750 [get_ports {axi0_RLAST}]
#set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.625 [get_ports {axi0_RRESP[1] axi0_RRESP[0]}]
#set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min 1.750 [get_ports {axi0_RRESP[1] axi0_RRESP[0]}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.625 [get_ports {axi0_RVALID}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min 1.750 [get_ports {axi0_RVALID}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.625 [get_ports {axi0_WREADY}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min 1.750 [get_ports {axi0_WREADY}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 3.675 [get_ports {regARESETn}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min -0.000 [get_ports {regARESETn}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.625 [get_ports {regARADDR[*]}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min -0.140 [get_ports {regARADDR[*]}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.625 [get_ports {regARID[*]}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min -0.140 [get_ports {regARID[*]}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.625 [get_ports {regARLEN[*]}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min -0.140 [get_ports {regARLEN[*]}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.625 [get_ports {regARSIZE[2] regARSIZE[1] regARSIZE[0]}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min -0.140 [get_ports {regARSIZE[2] regARSIZE[1] regARSIZE[0]}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.625 [get_ports {regARBURST[1] regARBURST[0]}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min -0.140 [get_ports {regARBURST[1] regARBURST[0]}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.625 [get_ports {regARVALID}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min -0.140 [get_ports {regARVALID}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.625 [get_ports {regAWADDR[*]}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min -0.140 [get_ports {regAWADDR[*]}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.625 [get_ports {regAWID[*]}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min -0.140 [get_ports {regAWID[*]}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.625 [get_ports {regAWLEN[*]}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min -0.140 [get_ports {regAWLEN[*]}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.625 [get_ports {regAWSIZE[2] regAWSIZE[1] regAWSIZE[0]}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min -0.140 [get_ports {regAWSIZE[2] regAWSIZE[1] regAWSIZE[0]}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.625 [get_ports {regAWBURST[1] regAWBURST[0]}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min -0.140 [get_ports {regAWBURST[1] regAWBURST[0]}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.625 [get_ports {regAWVALID}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min -0.140 [get_ports {regAWVALID}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.625 [get_ports {regBREADY}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min -0.140 [get_ports {regBREADY}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.625 [get_ports {regRREADY}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min -0.140 [get_ports {regRREADY}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.625 [get_ports {regWDATA[*]}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min -0.140 [get_ports {regWDATA[*]}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.625 [get_ports {regWSTRB[3] regWSTRB[2] regWSTRB[1] regWSTRB[0]}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min -0.140 [get_ports {regWSTRB[3] regWSTRB[2] regWSTRB[1] regWSTRB[0]}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.625 [get_ports {regWLAST}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min -0.140 [get_ports {regWLAST}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.625 [get_ports {regWVALID}]
set_output_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min -0.140 [get_ports {regWVALID}]
set_input_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.100 [get_ports {regARREADY}]
set_input_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min 1.400 [get_ports {regARREADY}]
set_input_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.100 [get_ports {regAWREADY}]
set_input_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min 1.400 [get_ports {regAWREADY}]
set_input_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.100 [get_ports {regBID[*]}]
set_input_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min 1.400 [get_ports {regBID[*]}]
set_input_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.100 [get_ports {regBRESP[1] regBRESP[0]}]
set_input_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min 1.400 [get_ports {regBRESP[1] regBRESP[0]}]
set_input_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.100 [get_ports {regBVALID}]
set_input_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min 1.400 [get_ports {regBVALID}]
set_input_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.100 [get_ports {regRDATA[*]}]
set_input_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min 1.400 [get_ports {regRDATA[*]}]
set_input_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.100 [get_ports {regRID[*]}]
set_input_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min 1.400 [get_ports {regRID[*]}]
set_input_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.100 [get_ports {regRRESP[1] regRRESP[0]}]
set_input_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min 1.400 [get_ports {regRRESP[1] regRRESP[0]}]
set_input_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.100 [get_ports {regRLAST}]
set_input_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min 1.400 [get_ports {regRLAST}]
set_input_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.100 [get_ports {regRVALID}]
set_input_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min 1.400 [get_ports {regRVALID}]
set_input_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -max 2.100 [get_ports {regWREADY}]
set_input_delay -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}] -min 1.400 [get_ports {regWREADY}]

# Clockout Interface
######################
# ddr_inst1 -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}]
# ddr_inst1 -clock regACLK -reference_pin [get_ports {regACLK~CLKOUT~2~518}]
